cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

echo "install formulae"

brew "n"
brew "node"
brew "yarn"
brew "hub"
brew "jq"
brew "flutter"
brew "mas"
brew "go"
brew "awscli"
brew "protobuf"
brew "tree"
brew "screen"
brew "tmux"
brew "neovim"

echo "install casks"

cask "postman"
cask "hazel"
cask "slack"
cask "iterm2"
cask "visual-studio-code"
cask "deepl"
cask "tableplus"
cask "notion"
cask "google-chrome"
cask "gyazo"
cask "github"
cask "clipy"
cask "alfred"
cask "karabiner-elements"
cask "docker"
cask "cocoapods"
cask "android-studio"
cask "discord"
cask "telegram"
cask "google-drive"
cask "microsoft-remote-desktop"
cask "fig"
cask "chatwork"
cask "spark"
cask "charles"

echo "install app from app store"

mas "xcode", id: 497799835
mas "line", id: 539883307
mas "Unsplash Wallpapers", id: 1284863847