cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# globalでインストールする
### Formulae
brew "n" # Managing node versions
brew "node" # Node.js
brew "yarn" # Node.js package manager
brew "hub" # GitHub 3rd party cli
brew "jq"  # JSON arrangement
brew "flutter" # Flutter

# https://github.com/mas-cli/mas
brew "mas" # Mac App Store

### casks
cask "postman"
cask "hazel"
cask "slack"
cask "iterm2"
cask "visual-studio-code"
cask "deepl"
cask "tableplus"
cask "notion"
cask "google-chrome"
cask "gyazo"
cask "github"
cask "clipy"
cask "alfred"
cask "karabiner-elements"
cask "docker"
cask "cocoapods"
cask "android-studio"

mas "xcode", id: 497799835
mas "line", id: 539883307
mas "runcat", id: 1429033973