cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"


echo "install formulae!"

brew "n" # managing node versions
brew "node" # node.js
brew "yarn" # node.js package manager
brew "hub" # github 3rd party cli
brew "jq"  # json arrangement
brew "flutter" # flutter
brew "mas" # get from app store
brew "goenv"

echo "install casks!"

cask "postman"
cask "hazel"
cask "slack"
cask "iterm2"
cask "visual-studio-code"
cask "deepl"
cask "tableplus"
cask "notion"
cask "google-chrome"
cask "gyazo"
cask "github"
cask "clipy"
cask "alfred"
cask "karabiner-elements"
cask "docker"
cask "cocoapods"
cask "android-studio"

echo "install app from app store"

mas "xcode", id: 497799835
mas "line", id: 539883307